export type RouteData = {
  imageSrc: string;
  title: string;
  subtitle: string;
  address: string;
  path: string;
  routeDisplayName: string,
  phone: string;
  info: string;
  location: string;
}

const routeData: RouteData[] = [
  {
    imageSrc: './images/hostel-1.jpg',
    title: 'Гуртожиток № 1',
    subtitle: '',
    address: '(вул. Крилова, 51)',
    path: '/hostel-1',
    routeDisplayName: 'list item 1',
    phone: '(0472) 45-01-82 ',
    location: '(кар 1). 4',
    info: 'Гуртожиток розрахований на 408 місць. Будівля на 9 поверхів введена в експлуатацію в 1977 році. Вартість проживання для студентів — 520 грн за місяць, 5200 грн за рік. На той час в гуртожитку проживали студенти філологічного факультету, що нараховував 3 відділення: російська мова та література, українська мова та література та іноземні студенти Казахстану, Узбекистану, Туркменії.    З реорганізацією педінституту навчальний заклад став Державним університетом і, як наслідок, до гуртожитку прийшли студенти інших факультетів: історики, юристи, соціальні педагоги. У гуртожитку, згідно проекту, система холів: 32 просторі холи, всього 128 затишних кімнат для проживання студентів, 16 кухонь, 3 кімнати самопідготовки, кімната студентської ради. Тренери  атлетично залу, що розташований на першому поверсі, допоможуть здійснити мрію про гарне натреноване тіло, підтримати здоров\'я. Чоловіча та жіноча душові кімнати загального користування, пральня — на першому поверсі. Для зручності мешканців, на кожному поверсі обладнано душові кімнати гігієни. Біля гуртожитку є спортивний майданчик. Вигідне розташування гуртожитку щодо автобусних зупинок, магазинів тощо. '
  }, {
    imageSrc: './images/hostel-2.jpg',
    title: 'Гуртожиток 2',
    subtitle: '',
    address: ' вул. Хрещатик, 53 ',
    path: '/hostel-2',
    routeDisplayName: 'Гуртожиток 2',
    phone: '(0472) 37-90-93',
    location: '(кар 1). 5',
    info: 'Вартість проживання для студентів — 520 грн за місяць, 5200 грн за рік. У гуртожитку проживають студенти ННІ української філології та соціальних комунікацій, ННІ економіки і права, ННІ педагогічної освіти, соціальної роботи і мистецтва, Психологічного факультету, аспіранти та викладачі університету. \n' +
      'Для зручності та поліпшення умов проживання діє пральна кімната, 2 душові кімнати загального користування (12 кабінок) на першому поверсі та душові в аспірантському блоці. На шостому поверсі розташована спортивна кімната. На четвертому поверсі розташована художня майстерня. На восьмому поверсі розташована кімната студентської ради. На дев’ятому поверсі розташована кімната самопідготовки студентів. У гуртожитку діє навчальна лабораторія фізичної та медичної реабілітації ННІ фізичної культури спорту і здоров’я. Біля гуртожитку розташовані футбольний, баскетбольний та волейбольний майданчики. Вдосконаленням та розвитком дозвілля студентів займається студентський актив за підтримки вихователя та завідуючої гуртожитком. '

  }, {
    imageSrc: './images/hostel-3.jpg',
    title: 'Гуртожиток 3',
    subtitle: '',
    address: 'вул. Хрещатик, 64',
    path: '/hostel-3',
    routeDisplayName: 'Гуртожиток 3',
    phone: ' (0472) 45-04-39',
    location: '(кар 1). 6',
    info: 'Проживають студенти ННІ фізики, математики та комп’ютерно-інформаційних систем, Факультету обчислювальної техніки, інтелектуальних та управляючих систем.  Кімнати розраховано на 3 особи. Кількість місць – 312.Вартість проживання для студентів — 520 грн за місяць, 5200 грн за рік. Студенти можуть використовувати тенісну кімнату, пральню, душові, на кожному поверсі умивальники, кухні, 4 аудиторії, 1 кімната для самопідготовки.'
  }, {
    imageSrc: './images/hostel-4.jpg',
    title: 'Гуртожиток 4 ',
    subtitle: '',
    address: 'вул. Хрещатик, 62',
    path: '/hostel-4',
    routeDisplayName: 'list item 4',
    phone: ' (0472) 45-14-03',
    location: '(кар 1). 7',
    info: 'Проживають студенти ННІ Фізичної культури, спорту і здоров’я; ННІ української філології та соціальних комунікацій; ННІ економіки і права; ННІ педагогічної освіти, соціальної роботи і мистецтва; ННІ історії і філософії. Всього студентських місць: 320. Вартість проживання для студентів — 520 грн за місяць, 5200 грн за рік. У гуртожитку для студентів працюють: кімнати самопідготовки, спортивна кімната, душові кімнати.'
  }, {
    imageSrc: './images/hostel-5.jpg',
    title: 'Гуртожиток 5',
    subtitle: '',
    address: 'вул. Хрещатик, 51',
    path: '/hostel-5',
    routeDisplayName: 'list item 5',
    phone: '(0472) 45-71-06',
    location: '(кар 1). 8',
    info: 'Гуртожиток розрахований на 494 особи. Вартість проживання для студентів — 520 грн за місяць, 5200 грн за рік. Проживають студенти ННІ природничих наук, ННІ іноземних мов та Психологічного факультету. У гуртожитку блочна система (у блоці проживає 10 осіб; кімнати на 2 та на 3 особи). На 10 осіб розрахована кухня, 2 туалети та 2 рукомийники. Для зручності студентів та поліпшення умов проживання існує пральна кімната, 2 душові кімнати загального користування на першому поверсі. На четвертому поверсі розташована спортивна кімната, а в холі знаходиться шведська стінка з комплектом тренажерів та тенісний стіл. '
  }, {
    imageSrc: './images/corpus-1.jpg',
    title: 'Навчальний корпус № 1',
    subtitle: '',
    address: '(бульвар Шевченка, 81)',
    path: '/corpus-1',
    routeDisplayName: 'Навчальний корпус № 1',
    phone: '(0472) 45-71-06',
    location: '(кар 1). 1',
    info: 'ННІ економіки і права (2, 4 пов.) ННІ природничих наук (6, 7, 8 пов.) ННІ української філології та соціальних комунікацій  (3 пов.) ННІ історії і філософії (5 пов.) Кафедра військової підготовки (4 пов.) Ректорат (2 пов.) Художні майстерні (8 пов.) Конференц-зал (2 пов.) Бухгалтерія (1 пов., 104 ауд.) Студентський відділ кадрів (1 пов., 101 ауд.) Юридична клініка (1 пов., 123 ауд.) Медичний пункт (1 пов.) Приймальна комісія Студія студентського телебачення (3 пов., 325 ауд.) Студія студентського радіо (3 пов., 328 ауд.) Музей історії університету Кафе «Затишок» (5 пов.) Кафе «Атенеум» (1 пов.) Кав’ярня'
  }, {
    imageSrc: './images/corpus-2.jpg',
    title: 'Навчальний корпус № 2',
    subtitle: '',
    address: '(вул. Остафія Дашкевича, 22)',
    path: '/corpus-2',
    routeDisplayName: 'Навчальний корпус № 2',
    phone: '(0472) 45-71-06',
    location: '(кар 2). 1',
    info: 'ННІ фізичної культури, спорту та здоров’я Ігровий спортивний зал Зал силової підготовки Зал боротьби Зал боксу та кікбоксингу Спортивний майданчик'
  }, {
    imageSrc: './images/corpus-3.jpg',
    title: 'Навчальний корпус № 3',
    subtitle: '',
    address: '(бульвар  Шевченка, 79)',
    path: '/corpus-3',
    routeDisplayName: 'Навчальний корпус № 3',
    phone: '(0472) 45-71-06',
    location: '(кар 1). 2',
    info: 'ННІ фізики, математики та комп’ютерноінформаційних систем (1, 2, 3 пов.) ННІ іноземних мов (4 пов.) Факультет обчислювальної техніки, інтелектуальних та управляючих систем (1, 2 пов.) Спортивний ігровий зал (3 пов.) Читальний зал наукової бібліотеки (1 пов., 107 ауд.) Центральний абонемент наукової бібліотеки (1 пов., 108 ауд.) Архів періодики  наукової бібліотеки (2 пов., 237 ауд. ) Актовий зал  (3 пов.) Малий актовий зал  (3 пов., 301 ауд.) 3 спортивні майданчики Кафе «У Людмили»  (1 пов.)'
  }, {
    imageSrc: './images/corpus-4.jpg',
    title: 'Навчальний корпус № 4',
    subtitle: '',
    address: '(вул. Остафія Дашкевича, 24)',
    path: '/corpus-4',
    routeDisplayName: 'Навчальний корпус № 4',
    phone: '(0472) 45-71-06',
    location: '(кар 2). 2',
    info: 'ННІ педагогічної освіти, соціальної роботи і мистецтва Психологічний факультет (1 пов.) 2 зали спортивних одноборств (1 пов.) Читальний зал наукової бібліотеки (1 пов.) Кафе «Орхідея» Навчальний '
  }, {
    imageSrc: './images/lib-1.jpg',
    title: 'Наукова бібліотека імені Михайла Максимовича',
    subtitle: '',
    address: '(вул. Університетська, 22)',
    path: '/lib',
    routeDisplayName: 'Наукова бібліотека',
    phone: '(0472) 45-71-06',
    location: '(кар 1). 3',
    info: 'Наукова бібліотека імені Михайла Максимовича'
  }
];

export default routeData;
