export const marks = [
  { name: 'Навчальний корпус № 1', lat: '49.4530143', lng: '32.0439008', type: 'corpus' },
  { name: 'Навчальний корпус № 2', lat: '49.4436149', lng: '32.0611971', type: 'corpus' },
  { name: 'Навчальний корпус № 3', lat: '49.4534537', lng: '32.0428977', type: 'corpus' },
  { name: 'Навчальний корпус № 4', lat: '49.4443087', lng: '32.0615887', type: 'corpus' },
  { name: 'Гуртожиток 1', lat: '49.4547623', lng: '32.0433886', type: 'hostel' },
  { name: 'Гуртожиток 2', lat: '49.4552717', lng: '32.0452397', type: 'hostel' },
  { name: 'Гуртожиток 3', lat: '49.4544672', lng: '32.0424892', type: 'hostel' },
  { name: 'Гуртожиток 4', lat: '49.4550527', lng: '32.0447664', type: 'hostel' },
  { name: 'Гуртожиток 5', lat: '49.4557596', lng: '32.0446075', type: 'hostel' },
  { name: 'Наукова бібліотека імені Михайла Максимовича', lat: '49.4540378', lng: '32.0451825', type: 'lib' }
]
